# LSByClass

## Description
Sets the default document line style to the line style of the active class.&lt;BR&gt;
&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE LSByClass;
```

```python

def vs.LSByClass():
    return None
```

## Remarks
Sets the global attributes to use the line style of the default class.<BR>
[sd 8/19/98]

## Version
Availability: from VectorWorks8.0
## Category
* Classes